[
    {
        "title": "UPDATE 2-IMF: Nicaragua's economy to grow 4% this year as migrant remittances jump",
        "link": "https://finance.yahoo.com/news/1-imf-sees-nicaraguas-economy-184226371.html",
        "date": "2023-11-22T18:42:26.000Z",
        "text": "\n\n(Rewrites story with details on record remittances)\n\nNov 22 (Reuters) - The International Monetary Fund (IMF) expects Nicaragua's economy to expand by 4% in 2023 due in large part to record remittances from migrants who have fled the Central American country, the lender said in a statement on Wednesday.\n\nThe IMF also said economic growth would likely continue next year and in the mid-term but at a lower rate than the historical average.\n\nFollowing a mission to the country, the international lender concluded that average inflation would likely fall to 8.9% this year, from 10.5% in 2022, and that the government will maintain a \"small\" budget surplus.\n\n\"Nicaragua's economy has remained resilient in the face of multiple shocks, supported by appropriate economic policies, substantial buffers, and multilateral support,\" according to the statement.\n\nCash transfers, or remittances, from Nicaraguan migrants living abroad are expected to contribute around 28% of the country's gross domestic product (GDP) in 2023, the IMF added, or double their contribution to the economy just two years ago.\n\nThe influx has been fueled by a \"rapid increase\" in Nicaraguan migration, the IMF statement added.\n\n\"The record-high remittances, coupled with sustained exports, are supporting a turnaround in the current account balance,\" according to the statement, which estimated the anticipated surplus at about 4% of GDP this year.\n\nNicaraguan migration has spiked since mass street protests erupted in Nicaragua five years ago and were met by a harsh response from the government that claimed more than 300 lives, according to rights groups.\n\nSome 900,000 migrants have left the country since then, according to human rights groups, with most seeking better prospects in the United States.\n\nNicaragua's total population stands at about 6 million. (Reporting by Ismael Lopez; Writing by David Alire Garcia; Editing by Brendan O'Boyle and Sonali Paul)",
        "stocks": []
    },
    {
        "title": "Safety officials release details of their investigation into a close call between planes in Texas",
        "link": "https://finance.yahoo.com/news/safety-officials-release-details-investigation-235825615.html",
        "date": "2023-11-29T23:58:25.000Z",
        "text": "\n\nDALLAS (AP) — The air traffic controller on duty when FedEx and Southwest planes nearly collided earlier this year in Texas told investigators that he expected the airliner to take off more quickly — before the incoming FedEx plane reached the same runway.\n\nThat is because in his four years working the tower at Austin-Bergstrom International Airport, the controller said, Southwest planes usually took off as soon as they got permission.\n\n“But hindsight being 20/20,” controller Damian Campbell told investigators, he “definitely could have held them,” referring to making the Southwest crew wait.\n\nCampbell said in a transcript released Wednesday that he couldn't even see the Southwest plane through the dense early morning fog on Feb. 4. The FedEx pilots spotted it at the last second and aborted their landing.\n\nThe planes missed each other by about 100 feet (30 meters).\n\nThe National Transportation Safety Board released transcripts of interviews and other details of its investigation but did not state a probable cause for the harrowing close call. That determination is expected early next year.\n\nThe near-disaster in Austin is the scariest among more than a half-dozen close calls that the NTSB has investigated this year.\n\nThe surge in such incidents prompted the Federal Aviation Administration — which hires air traffic controllers and manages the nation's airspace — to convene a “safety summit” of aviation industry officials this spring.\n\nA panel of independent experts concluded this month that the FAA needs better staffing, equipment and technology to cope with a surge in serious close calls. The panel said aviation's margin of safety is shrinking.\n\nThe captain of the FedEx plane flying into Austin said he was “irritated” and “perplexed” when the controller cleared Southwest to take off from runway 18-left, the one he was approaching.\n\n“My initial response was an expletive, like ‘What’s he doing?'” Hugo Carvajal III told investigators. Still, he assumed that the Southwest plane “was going to be well down the runway” by the time he touched down.\n\nCarvajal's first officer, Robert Bradeen Jr., estimated they were 100 to 150 feet (30 to 45 meters) above the runway when he saw the Southwest jet — first a light, then a silhouette of a wing.\n\n“I think I said, 'Go around, go around, go around” to the captain, Bradeen said, meaning pull up and fly away. He used the radio to tell the Southwest crew to abort their takeoff, but they did not.\n\nAsked what saved the day — special training or something else, Bradeen said, “I think it was more experience and just the combination of luck that I happened to look out (the cockpit window) at the right time.”\n\nAt a recent congressional hearing, the president of the union representing air traffic controllers complained about understaffing and frequent overtime leading to fatigue.\n\nCampbell, a Navy veteran who had been a controller for 13 years at the time of the Austin incident, said he was on a mandatory six-day work week.\n\nAustin-Bergstrom doesn't have the latest technology, called ASDE-X, for tracking planes and vehicles on the ground — which could have helped prevent the February close call.\n\n“We had this dense ground fog ... you couldn't see anything,” Campbell told investigators. He couldn't see the Southwest jet from the tower.\n\n“It became a concern when I didn't hear Southwest's engines” revving for takeoff on a flight to Cancun, Mexico, he said. “And at that point, it became a critical issue.”",
        "stocks": []
    },
    {
        "title": "PayPal Rival Adyen Tempers Growth Targets to Regain Confidence",
        "link": "https://finance.yahoo.com/news/paypal-rival-adyen-tempers-growth-193202071.html",
        "date": "2023-11-08T19:32:02.000Z",
        "text": "\n\n(Bloomberg) -- Adyen NV provided a more moderate set of growth targets for the next three years as the Dutch payments processor seeks to manage investor expectations after a recent sales slowdown triggered a selloff.\n\nMost Read from Bloomberg\n\nRockstar Plans to Announce Much Anticipated ‘Grand Theft Auto VI’\n\nUS 30-Year Mortgage Rate Tumbles by Most in More Than a Year\n\nAdam Neumann Remains a Billionaire Even With WeWork Bankruptcy\n\nVIX Notches Its Longest Slide Since October 2015: Markets Wrap\n\nVirginia Democrats Fend Off Republican Sweep in Win for Abortion Rights\n\nThe company now targets growth in the low- to high-20 percent range, according to a statement released after European market hours on Wednesday. That compares to a previous medium-term forecast, which called for annual increases between the mid-20s and low-30s. The Dutch payments company’s US-listed ADRs jumped as much as 37%.\n\nWhile Adyen said its “substantial long-term opportunity remains unchanged,” it wanted to specify its expectations for the coming three years.\n\nRevising forecast with a third-quarter update is a departure from its customary half-yearly reports and reflects pressure to provide greater clarity on its growth trajectory. It comes after Adyen had shocked the market in August by disclosing its slowest net revenue increase since listing in 2018. Its shares plunged 39% that day, and the shaken confidence has erased €24.1 billion ($25.8 billion) of its market value since then.\n\nInvestors had demanded more frequent financial communication and a clear blueprint for achieving its growth ambitions, and many questioned whether the medium-term targets need to be reset.\n\nRead More: PayPal Rival Fintech Adyen Faces Investor Confidence Test\n\nIn its business update on Wednesday, Adyen also said it aims to improve earnings before interest, taxes, depreciation and amortization to above 50% of sales in 2026. In the past, it has only detailed a long-term target for Ebitda margins of above 65%.\n\nWhat Bloomberg Intelligence Says:\n\n“Adyen’s lowered guidance for net revenue growth (low 20% to high 20%) and Ebitda margin above 50% in 2026 (vs. 65% long term target) is now closer to consensus and reflects competition in the payments industry and a worsening economic backdrop. Its 3Q update signaled a scaling back of hiring in 2024, with cost control now more critical as revenue momentum slows.”\n\n—Tomasz Noetzel, BI Banking Analyst\n\nAdyen New Ebitda Margin Realigned to Reality: React\n\n“With regards to the updated midterm ambition we remain cautious given the wide range of outcomes,” Jefferies International analyst Hannes Leitner said in a note to clients. He said that while the overall targets are “likely more realistic, they still look ambitious.”\n\nIt also outlined plans to update the market more often. Listening to investor feedback, “we understand that more updates about how the business is developing along the way would helpful,” Adyen Chief Financial Officer Ethan Tandowsky said at the company’s investor day in San Francisco. “We plan to share quarterly updates in the year ahead at least,” he said.\n\nAdyen, which competes with the likes of Stripe Inc. and PayPal Holdings Inc.-owned Braintree, had attributed the sales slowdown in the first half of the year to increasing price competition in North America, its second-largest market. It had said customers there had tightened purse strings and shifted some volumes to cheaper rivals.\n\nNet revenue in the third quarter rose 22% to €413.6 million and processed volume increased at a similar pace to €243.1 billion, the Amsterdam-based company said. The firm added 175 employees in the third quarter, saying it is in the “final stages” of its industry-defying hiring push.\n\n(Updates to add analyst and CFO comments from seventh paragraph)\n\nMost Read from Bloomberg Businessweek\n\nElon Musk’s Brain Implant Startup Is Ready to Start Surgery\n\nIn Uruguay, a Tax Haven With Lots of Beaches and Little Crime\n\nCan a Triangle-Shaped Jet Cut Fuel Consumption in Half?\n\nPrivate Equity Courts a Growing Class of Mini-Millionaires\n\nTop-Ranked MBA Programs Struggle to Reverse Declining Applications\n\n©2023 Bloomberg L.P.",
        "stocks": []
    },
    {
        "title": "ArcelorMittal suspends output in Bosnia as steel demand drops",
        "link": "https://finance.yahoo.com/news/arcelormittal-suspends-output-bosnia-steel-145010528.html",
        "date": "2023-11-17T14:50:10.000Z",
        "text": "\n\nSARAJEVO (Reuters) - ArcelorMittal said on Friday it had temporarily halted output at its Bosnia steel plant and at mines that supply it with iron ore due to a drop in demand in the European steel market.\n\nThe company, which produces about 700,000 tonnes of liquid steel annually and employs about 2,200 workers, said the European steel market has cut demand due to a lower steel consumption that begun in 2022 with the war in Ukraine, the spike in energy prices and output costs, as well as inflation.\n\nThe ArcelorMittal plant in the central town of Zenica said that it halted the operation of its High Oven last Saturday and then gradually stopped the output in other drives, after carefully considering all options available.\n\n\"ArcelorMittal Zenica plans to continue with normal operation as soon as demand returns to the level that enables sustainable business,\" it said in a statement to Reuters.\n\n\"Conditions of demand have significantly worsened in the second half of 2023, and there are expectations that this negative cycle will continue led by a continued economic uncertainty resulting from high inflation,\" the statement said.\n\nIt also said that sales quotas have been limited due to the protective regime imposed by the European Union, and that steel makers had to compete with cheaper steel products imported from Turkey.\n\nAt the same time, the concentration of the metal in the iron ore obtained from the Omarska mines that supply the plant has fallen to 47% from 53%, which means that bigger ore quantities must be purchased for the production of the same quantity of the metal, the company said.\n\nIt said that it has also halted the deliveries from the iron ore mines for as long as its output has been suspended. The Omarska mines further to the north, employing about 850 workers, fully depends on the sales of ore to the Zenica plant.\n\nLast month, the worker unions announced a general strike requesting a new bargaining deal but they are pondering to postpone it after the company has halted production.\n\nArcelorMittal said it had increased wages 32% since 2020 because of the inflation.\n\n(Reporting by Daria Sito-Sucic; Editing by David Evans)",
        "stocks": []
    },
    {
        "title": "UPDATE 1-Barrick CEO says focused on organic growth, dismisses interest in First Quantum",
        "link": "https://finance.yahoo.com/news/1-barrick-ceo-says-focused-210722865.html",
        "date": "2023-11-02T21:07:22.000Z",
        "text": "\n\n(Adds more quotes from the interview and background, updates First Quantum shares)\n\nBy Divya Rajagopal\n\nTORONTO, Nov 2 (Reuters) - Barrick Gold's CEO on Thursday expressed a desire to grow the company's copper business organically when asked about interest in buying fellow Canadian miner First Quantum Minerals after its shares lost nearly half their value earlier this week.\n\nFirst Quantum's stock plunged in the three trading days of this week after the Panama government said it will hold a referendum to decide whether to revoke the miner's contract to operate one of the biggest and the newest copper mines in the world. The stock rose about 8.1% on Thursday.\n\n\"At this point of time, I think we've got a lot on our plate and they (First Quantum) are dealing with a difficult situation, so we will focus on our strategy,\" CEO Mark Bristow told Reuters when asked whether Barrick has interest in acquiring First Quantum.\n\nBristow added that the company is growing its copper on its own, repeating a similar stance he took in an August interview with Reuters when he dismissed a June media report that Barrick was in talks with First Quantum on a possible acquisition.\n\nEarlier on Thursday, Barrick beat analysts estimates for its quarterly helped by lower cost and high gold prices.\n\nBarrick has been investing in copper as the red metal is poised to play a key role in the transition to a greener economy. But instead of striking deals like its peers, such as BHP Group and Rio Tinto, that have bought copper mines in the past two years, Barrick has focused on investing in its own mines.\n\n\"This is a reinforcement of what I stand for in Barrick... For me, M&A is an ad hoc opportunity to create value. It shouldn't be the core to anyone's strategy,\" he added.\n\nWhen asked if Barrick has offered advise to First Quantum on the Panama situation, Bristow said, \"It's a tough time for any company and I don't want to put my finger in this soup.\"\n\n(Reporting by Divya Rajagopal, Editing by Franklin Paul and Marguerita Choy)",
        "stocks": []
    }
]