[
    {
        "title": "UNRWA says its Gaza fuel depot is now empty, warns of further shutdowns",
        "link": "https://finance.yahoo.com/news/unrwa-says-gaza-fuel-depot-125004973.html",
        "date": "2023-11-13T12:50:04.000Z",
        "text": "GENEVA, Nov 13 (Reuters) - The U.N. Palestinian refugee agency's fuel depot in Gaza has run dry and within a few days UNRWA will no longer be able to resupply hospitals, remove sewage and provide drinking water, its chief said on Monday.UNRWA is sheltering nearly 800,000 people, or about half of the total population of Gazans who have fled their homes since an Israeli military campaign began over a month ago in response to deadly Hamas attacks on Israel on Oct. 7.The agency chief, Commissioner-General Philippe Lazzarini, told donors on Monday that it had been slowly emptying a fuel depot on the Israeli border containing strategic reserves.A request to the Israeli military to replenish it had gone unanswered, he said.\"That reservoir is now empty,\" Lazzarini said.\"If we project out a couple of days, by the 14th of November this will severely impact ambulances and major hospital operations. Some of them (hospitals) have a bit of solar but it is marginal, so those hospitals cease functioning,\" he said.Already, many hospitals have had to close in Gaza due to war damage or lack of fuel, including al-Quds, one of the major hospitals in the north of Gaza that has been the focus of Israel's ground invasion.Israel's military has so far refused imports of fuel into Gaza, saying they could be diverted to Hamas for military purposes.UNRWA's fuel is also used to remove hundreds of tonnes of solid waste from increasingly overcrowded camps in southern Gaza, and Lazzarini said these services would soon halt.Without fuel, desalination plants in the narrow, densely populated coastal strip used to provide drinking water to support at least 290,000 people will also stop on Nov. 15, he added.\"So the situation is very dire now and it's about to get much worse,\" Lazzarini told donors.(Reporting by Emma Farge; editing by Mark Heinrich)",
        "stocks": []
    },
    {
        "title": "Mrketmind: Vale Charlie Munger",
        "link": "https://finance.yahoo.com/news/mrketmind-vale-charlie-munger-053209842.html",
        "date": "2023-11-29T05:32:09.000Z",
        "text": "A look at the day ahead in European and global markets from Tom WestbrookAn era has drawn to a close with the death of Charlie Munger, a month short of his 100th birthday.The union of Munger and Warren Buffett is among the most successful in the history of business, transforming Berkshire Hathaway into a multi-billion dollar conglomerate.Often handy with a one-liner Munger summed up his fame in 2010: \"I think part of the popularity of Berkshire Hathaway is that we look like people who have found a trick,\" he said.\"It's not brilliance. It's just avoiding stupidity.\"Buffet noted \"Charlie's inspiration (and) wisdom\" in a statement.Investors in Asia, meanwhile, took comments from erstwhile Federal Reserve hawk Christopher Waller as perhaps a signal of another era-shift, as he flagged that U.S. interest rates could be cut in the months ahead.A rally in bonds and slide in the dollar that has run for weeks in the afterglow of a benign U.S. inflation report extended in Asia in the wake of Waller's remarks.Two-year Treasury yields fell to a four-month low just below 4.70%. Ten-year Treasury yields hit a two-month low of 4.28%.Interest rate futures price more than 100 basis points of cuts next year and a 40% chance they begin as soon a March.The dollar's slide led to multi-month highs for the yen, euro, sterling and Swiss franc against the greenback and sent spot gold, in dollars, to its highest since May.German inflation data and Eurozone confidence surveys are the next major economic calendar items for traders to watch.In the Asia session Australian inflation came in below expectations, while New Zealand's central bank surprised investors with a warning that rate hikes may not be finished if price pressures do not ease.China's stockmarkets also stood out.With cheer that U.S. interest rates have peaked spreading across global markets, the MSCI index of world stocks is up 8.8% in November and heading for its largest monthly percentage gain in three years.Chinese blue chips by contrast are down more than 2% this month and set for a fourth straight monthly drop. Hong Kong's Hang Seng is down 0.4% in November.Key developments that could influence markets on Wednesday:German and Spanish CPI, eurozone consumer confidence, Fed's beige book(Editing by Sam Holmes)",
        "stocks": [
            "BRK-B"
        ]
    },
    {
        "title": "Why you should care about this week’s AI drama",
        "link": "https://finance.yahoo.com/news/why-you-should-care-about-this-weeks-ai-drama-110028507.html",
        "date": "2023-11-21T11:00:28.000Z",
        "text": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:The chart of the dayWhat we're watchingWhat we're readingEconomic data releases and earningsWe've got quite a fun business story to discuss over our Thanksgiving turkeys this year.Sam Altman was fired by the OpenAI board! He’s starting another company! Wait, the OpenAI board wants him back! No, it doesn’t! Microsoft (MSFT) is hiring him! OpenAI employees are revolting!It’s got everything — big personalities; big companies; dramatic, fast-moving developments; and a technology that’s been both a buzzword and a driver of returns this year.But the story also has real repercussions for investors and anyone who will be affected by artificial intelligence — that is, pretty much everyone.First, let’s take the implications for investors, particularly those who hold Microsoft shares. As my colleague Josh Schafer outlined, many analysts are cheering CEO Satya Nadella’s move to bring Sam Altman fully into the fold after forging a relationship with him, both personal and financial. That’s reflected in Monday’s bounce in Microsoft shares, which initially fell on Friday on the news that Altman was departing OpenAI, in which Microsoft had invested.This could potentially solidify what some see as Microsoft’s lead in AI. Through its collaboration with OpenAI, it has incorporated ChatGPT into its Bing search engine and other products. Now, by directly hiring Altman and one of his co-founders, Greg Brockman, “Mr. Nadella may have pulled off his own coup, acquiring the most important part of OpenAI — its ambitious talent,” wrote Macquarie analyst Frederick Havemeyer in a note to investors.That could potentially leave some of Microsoft’s competitors in AI – particularly the likes of Alphabet and Meta – on the back foot.On the other hand, they too could hire some of the OpenAI workers. (As of this writing, more than two-thirds of OpenAI’s employees had reportedly threatened to resign.) There’s also the wrinkle that Microsoft owns 49% of OpenAI, which is now in disarray, though Semafor has reported that it hasn’t yet wired the company its full investment.So the stakes are high for Microsoft and its peers.The much bigger question is what this means for the development of AI — a technology that this year has been touted as having the ability to change the way we work and live.Reportedly, one of the points of contention between Altman and members of the board was how quickly to develop and commercialize new, AI-based technologies while still not posing a threat to humanity. That threat has been flagged by everyone from one of the “godfathers of AI” to Elon Musk to Sam Altman himself, along with a who’s who of AI luminaries.Now that Altman is under the purview of a public company whose job is explicitly to make money for shareholders versus the nonprofit that controls OpenAI, whose “principal beneficiary is humanity, not OpenAI investors,” will he be more likely to brush aside those potential threats? Or was the mission statement a fig leaf anyway?Will this newsletter be written by our AI overlords a year or five years from now as a result of this pivotal decision by OpenAI to fire Sam Altman, setting off a chain of events that will lead him to prioritize profit over prudence and lead to humanity’s downfall?Probably not. But it still reminds us of a specter hovering over all of this AI hype — the power over this technology with the huge potential to shape our futures is concentrated in just a few hands.Click here for the latest stock market news and in-depth analysis, including events that move stocksRead the latest financial and business news from Yahoo Finance",
        "stocks": [
            "MSFT"
        ]
    },
    {
        "title": "Lucid cuts prices of electric sedans for limited time amid EV price wars",
        "link": "https://finance.yahoo.com/news/lucid-cuts-prices-electric-sedans-175455690.html",
        "date": "2023-11-03T17:54:55.000Z",
        "text": "(Reuters) - Lucid Group cut prices of its Air range of luxury sedans earlier this week for a limited time ahead of the holiday season, amid stiff competition and slowing demand for electric vehicles(EV). High-interest rates have hit demand for EVs, and auto manufacturers, led by the world's most valuable automaker Tesla, have responded by cutting prices.The Elon Musk-led automaker has cut sticker prices multiple times this year to fend off new lower priced electric vehicles from eating into its depleting market share.The EV price war has forced companies to prioritize sales over margins and has brought down the average price of EVs to $50,683 in September, a report by Cox Automotive showed.Lucid slashed the price of its Air Touring model to $87,500 from $95,000 and the more powerful Grand Touring by $10,000 to $115,600.The Newark, California-based company also slashed the price of its all-wheel drive Air Pure to $74,900 from $82,400. The price of its latest offering, the rear-wheel drive Air Pure, remains unchanged at $77,400.Tesla has cut the prices of its Model S premium sedan, Lucid Air's closest competitor, to $74,990.Lucid had previously cut prices for its cars in August as the company burned through cash as it ramped up production in a tough economy.However, backing from Saudi Arabia's Public Investment Fund has given the company, which is set to report its third-quarter results on Tuesday, a liquidity boost over some of its other cash-crunched peers.The price cut offer will be valid till Nov 30, the company said.(Reporting by Zaheer Kachwala in Bengaluru; Editing by Tasim Zahid)",
        "stocks": [
            "TSLA"
        ]
    },
    {
        "title": "Britain says makers, not car owners liable for self-driving crashes",
        "link": "https://finance.yahoo.com/news/britain-says-self-driving-car-115403782.html",
        "date": "2023-11-07T11:54:03.000Z",
        "text": "By Alistair Smout and Nick CareyLONDON (Reuters) -Britain will make the makers rather than the owners of self-driving cars legally liable for any crashes under a framework for developing autonomous vehicles (AV), the government said on Tuesday, in a move welcomed by insurers and AV startups.King Charles said the government would bring forward an Automated Vehicles Bill as he set out the government's legislative agenda for the forthcoming parliamentary session, after one promised last year did not materialise.\"My ministers will introduce new legal frameworks to support the safe commercial development of emerging industries, such as self-driving vehicles,\" Charles said in a speech to lawmakers.Tara Foley, head of UK and Ireland operations for global insurer AXA, said this would add \"multiple benefits for the UK economy, road safety and green jobs\".\"For insurers, it also provides crucial clarity for establishing liability for self driving,\" she added.Companies had said Britain could lose out on investments and startups would carry out testing elsewhere unless promised laws regulating AV technology were passed before the next general election, expected next year.\"(The) new primary legislation for self-driving vehicles gives us the confidence to continue investing in R&D and growing our talent base here in the UK,\" said Alex Kendall, CEO of AV startup Wayve, which has raised around $260 million from investors, including Microsoft.The government said the bill would protect users and promote safety in the AV industry.\"While the vehicle is driving itself, a company rather than an individual will be responsible for the way it drives,\" the government said.Self-driving industry experts have said national regulatory frameworks and establishing legal liability are crucial to winning public acceptance of autonomous vehicles and for insurers to provide coverage.The bill will establish processes to investigate incidents and improve the safety framework, and will also set the threshold for what is classified as a self-driving car.In the U.S. market, where states have led the way in testing self-driving cars, California regulators last month ordered General Motors' driverless car unit Cruise to remove its vehicles from state roads, saying it had misrepresented the technology's safety.Paul Newman, founder of Oxford-based AV software firm Oxa, which has raised about $225 million from investors, said the UK's proposed framework would unequivocally avoid a repeat of Cruise's situation in Britain because it clearly delineates responsibilities.\"There's an inevitability to this technology,\" he said. \"This a fantastic opportunity to get out in front and... create frameworks to build public trust.\"(Reporting by Alistair Smout, Nick Carey and William James; Editing by Kate Holton and Barbara Lewis)",
        "stocks": []
    },
    {
        "title": "Palo Alto Networks Slips After Missing Billings Estimate",
        "link": "https://finance.yahoo.com/news/palo-alto-networks-slips-missing-215903364.html",
        "date": "2023-11-15T21:59:03.000Z",
        "text": "(Bloomberg) -- Cybersecurity firm Palo Alto Networks Inc. tumbled after missing Wall Street estimates for billings in its fiscal first quarter and lowering its estimates for the full year.Most Read from BloombergThe Doomed Mission Behind Sam Altman’s Shock Ouster From OpenAIMicrosoft Ends Weekend of OpenAI Drama With Coup of Its OwnCitigroup Cuts Over 300 Senior Manager Roles in Latest RestructuringNearly All of OpenAI Staff Threaten to Go to Microsoft If Board Doesn’t QuitOpenAI Leaders' Efforts to Bring Back Altman Reach Impasse Over Board RoleThe company said billings were $2.02 billion in the three months ended Oct. 31, and said full-year fiscal billings would be $10.7 billion to $10.8 billion, down from earlier projections of $10.9 billion to $11 billion.The shares fell to as low as $226.09, in extended trading, after closing at $256.18 in New York.Palo Alto shifted its strategy into software over hardware compared to its peer Fortinet Inc., capitalizing on growth from artificial intelligence and cloud computing trends. A number of high profile cyberattacks - most recently Industrial & Commercial Bank of China Ltd. - has reiterated the importance of cybersecurity even as technology budgets shrink.“An unprecedented level of attacks is fueling strong demand in the cybersecurity market,” said Chief Executive Officer Nikesh Arora in a statement.Total revenue for the fiscal first quarter was $1.88 billion, just above analysts’ estimates of $1.84 billion.Investors were concerned after Fortinet Inc. gave a disappointing outlook for revenue earlier this month, thinking the fallout would bleed into Palo Alto. Fortinet, CrowdStrike Holdings Inc. and Zscaler Inc. all fell after Palo Alto reported earnings.Palo Alto Networks Chief Financial Officer Dipak Golechha attributed the company’s disappointing billings to “the cost of money.”Arora told analysts on a call that “customers significant focus on this topic is becoming the new normal. The way it manifests itself in our businesses that there’s always a payment in duration discussions and finally negotiations.”The Santa Clara, California-based company recently pursued an aggressive deal strategy to expand data security capabilities. The company acquired Israeli startups Talon Cyber Security Ltd. and Dig Security Solutions Ltd., totaling over $1 billion in M&A spending.Palo Alto said it expects billings in the second fiscal quarter of $2.34 billion to $2.39 billion, also falling short of Wall Street targets.(Updates with additional information throughout.)Most Read from Bloomberg BusinessweekMore Americans on Ozempic Means Smaller Plates at ThanksgivingThe Share of Americans Who Are Mortgage-Free Is at an All-Time HighInflation Raging in Triple Digits Is Pushing Argentina Down a Radical PathThe Impact and Cost of Musk’s Endorsement of Antisemitism on XSequoia Icon Michael Moritz Bets $300 Million on Reshaping San Francisco©2023 Bloomberg L.P.",
        "stocks": [
            "PANW",
            "FTNT"
        ]
    },
    {
        "title": "Exclusive-OPEC hears bearish message on oil from top swap dealer's presentation",
        "link": "https://finance.yahoo.com/news/exclusive-opec-hears-bearish-message-102326393.html",
        "date": "2023-11-22T10:23:26.000Z",
        "text": "By Ahmad GhaddarLONDON (Reuters) -An OPEC technical panel invited a top financial market dealer to give a presentation this week which painted a bearish outlook for the oil market, according to materials from the presentation seen by Reuters.\"Market sentiment had been fragmented for much of this year, but the evidence is that there has been a recent shift in collective sentiment to bearish as we head towards the end of the calendar year,\" one of the presentation slides by Onyx Capital Group showed.OPEC - the Organization of the Petroleum Exporting Countries - did not immediately reply to a request for comment.London-based Onyx Capital Group is the world's biggest market maker by volume across oil swaps, trading more than 25 billion barrels equivalent a year. It says it owns a dataset that analyses market positions to predict how the market behaves.Onyx CEO Greg Newman gave the presentation, according to a company tweet on X, formerly Twitter. Its content was not made public, however.According to the materials seen by Reuters, it also showed that Brent futures had undergone two significant sell-offs since the start of the quarter, with the first, from Sept. 27 to Oct. 2, driven by weak U.S. gasoline markets and financial speculators.Saudi Energy Minister Prince Abdelaziz bin Salman, OPEC's most influential minister, famously warned financial speculators against betting heavily in the oil market in 2020, challenging those looking to short the market to \"make my day\".The second sell-off, which happened in November, moved the oil market to a collective neutral-to-bearish sentiment, with commercial participants like oil producers and airlines joining financial speculators in seeing a weak outlook.\"The second aggressive moves were correlated with a weakening forward outlook for underlying crude and refined products market,\" Onyx said in the presentation materials.It added that the oil market forward curve signalled the market expects supply of heavy crude, which several OPEC members produce, will likely come back next year, and inventories will start to rebuild.The Economic Commission Board (ECB), which OPEC describes as its \"think-tank\", meets twice a year ahead of the ordinary ministerial OPEC conference to review market conditions and economic developments.While it has no decision-making capacity, the research it produces is important for ministers that will eventually decide on output policy.Ministers from OPEC and allies led by Russia, a group known as OPEC+, are due to meet on Sunday to decide on output policy.The group is likely to discuss output cuts to shore up falling oil prices, which are down more than 13% since the start of this quarter.Goldman Sachs this week said it expected Saudi Arabia and Russia to extend their voluntary oil production cuts into the first quarter 2024.It also sees a 35% possibility the group will deepen production cuts, potentially through another 0.5-1 million barrel per day reduction shared among the large producers, including Saudi Arabia, Russia, the UAE, Iraq, and Kuwait.The ECB on Tuesday also heard presentations from banks JPMorgan and BNP Paribas, three sources told Reuters. It will meet for a second day on Wednesday.(Additional reporting by Dmitry Zhdannikov; Editing by Jan Harvey)",
        "stocks": [
            "CL=F"
        ]
    },
    {
        "title": "Ramaswamy’s Crypto Deregulation Plan Is Scaring the Industry",
        "link": "https://finance.yahoo.com/news/ramaswamy-crypto-deregulation-plan-scaring-191657693.html",
        "date": "2023-11-22T19:16:57.000Z",
        "text": "(Bloomberg) -- Presidential candidate Vivek Ramaswamy’s call for mass deregulation of the cryptocurrency industry and drastic cuts to the Securities and Exchange Commission are the makings of crypto regulators’ nightmares, yet a version of that plan could be a reality if a Republican wins the White House.Most Read from BloombergAltman Returns as OpenAI CEO in Chaotic Win for MicrosoftMcKinsey and Its Peers Are Facing the Wildest Headwinds in YearsHulu for $1, Max for $3: Streaming Services Slash Prices This Black FridayOpenAI Engineers Earning $800,000 a Year Turn Rare Skillset Into LeverageDutch Far-Right Leader Wilders Scores Shock Election VictoryRamaswamy — who is polling in the single digits — is unlikely to become the 2024 Republican presidential nominee, but he has echoed many policy positions of frontrunner Donald Trump, teeing himself up for a potential high-profile spot in a GOP administration that could have significant sway over crypto.Ramaswamy’s proposal would eliminate many of the few crypto regulations in effect and cut the SEC and other regulatory agencies’ workforces by 75%. That has raised alarms in the industry, particularly given its proximity to the criminal conviction of Sam Bankman-Fried following the implosion of his trading platform FTX and guilty pleas announced Tuesday from crypto exchange Binance Holdings Ltd. and its founder, Changpeng Zhao, on anti-money laundering and US sanctions violations charges.The series of high-profile crypto misdeeds has prompted congressional lawmakers to pursue more oversight of the industry to protect consumers, making Ramaswamy out of step with members of both parties and many inside the industry who want a baseline of regulations to help legitimize the technology which has been subject to a wave of bad headlines over the past year.“It’s not like there’s a ton of regulation now,” said Howard Fischer, a partner at Moses Singer and former SEC lawyer. “There is a perception of significant risk, and if there is no regulation whatsoever, I think that that’s going to lead a lot of investors and participants to shy away from the space.”The 2024 election is the first presidential race where crypto has been treated as a serious policy issue, and Ramaswamy is the first Republican candidate to release a plan regarding the currency.“The recent examples of large-scale fraud (e.g. FTX) reveal that the status quo is at once insufficient to protect ordinary investors, while also impeding innovation,” Ramaswamy said in a statement. “The policy principles that I announced – freedom to code, freedom to financial self-reliance, and freedom from regulatory overreach – are the first step toward a broader regulatory framework for digital assets.”His campaign has financial backing from some in the crypto industry, including Gemini exchange co-founders Tyler Winklevoss and Cameron Winklevoss. Fred Ehrsam, co-founder of Paradigm Operations LP and Coinbase Global Inc., Bitgo co-founder Michael Belshe and Blockchain Association CEO Kristin Smith also donated.Ramaswamy calls for a series of changes, including prohibiting federal agencies from creating restrictions on crypto wallets and clarifying that the Bank Secrecy Act does not govern blockchain infrastructure providers. These changes would likely involve input from Capitol Hill, meaning his plan can’t become law without the approval of lawmakers.“This is not something that the executive branch can just do,” said Reena Aggarwal, director of the Psaros Center for Financial Markets and Policy at the Georgetown School of Business. “Congress would be involved in a big way, so it’s not reality.”Those looking to influence a second Trump administration’s policy agenda are also looking to curb crypto regulation. The Heritage Foundation’s Project 2025, a comprehensive look at how a Republican White House should view policy, calls to shift crypto regulation away from the SEC and into the Commodity Futures Trading Commission, an agency that the industry believes to be more crypto-friendly.Peter St Onge, an economist at the Heritage Foundation, said Ramaswamy’s proposal aligns with his employer’s view of the SEC, which he believes does not adequately fight fraud.“They either become captured by the industries that they’re supposed to be policing, particularly salient in finance, or they justify their existence by creating these burdens that end up hurting the overall market,” he said.Congress has begun to contemplate a more comprehensive framework for crypto assets. Senator Cynthia Lummis, a Wyoming Republican, and Senator Kirsten Gillibrand, a New York Democrat, have sponsored a bill viewed as taking an industry-friendly approach, and that Lummis has said “appropriately balances consumer protections while allowing innovation to thrive.”“The crypto asset industry desperately needs clear rules of the road to protect consumers while encouraging innovation,” Lummis said in a statement. “Eliminating the few protections we currently have instead of installing additional consumer-focused guardrails would be a grave misstep.”Senator Elizabeth Warren, a Massachusetts Democrat, has contemplated a more restrictive approach that would crack down on digital asset use, drawing connections to money laundering and sanctions evasion.The SEC declined to comment on Ramaswamy’s proposal.Voters themselves are also hesitant to let crypto exist rules-free. An April Pew survey found 75% of Americans who have heard of crypto are not confident in its safety and reliability.“With the American people, crypto is toxic,” said Dennis Kelleher, CEO of nonprofit Better Markets who previously served on President Joe Biden’s transition team working with financial regulation. “American investors and customers have lost trillions of dollars in crypto over the last couple of years.”--With assistance from Lydia Beyoud and Bill Allison.Most Read from Bloomberg BusinessweekHow Elon Musk Spent Three Years Falling Down a Red-Pilled Rabbit HoleThe Utah Jazz Enter Their Experimental Post-Cable PhaseMore Americans on Ozempic Means Smaller Plates at ThanksgivingX Scrambles to Minimize Damage From Antisemitic PostsGuatemalan Town Invests Remittance Dollars to Deter Migration©2023 Bloomberg L.P.",
        "stocks": []
    },
    {
        "title": "China’s Belt and Road Eyes Smaller Projects, More Use of Yuan",
        "link": "https://finance.yahoo.com/news/china-belt-road-eyes-smaller-071427652.html",
        "date": "2023-11-24T07:14:27.000Z",
        "text": "(Bloomberg) -- China said it would prioritize small projects and push for greater use of the Chinese currency through its Belt and Road Initiative, as President Xi Jinping looks to inject new life into his flagship investment program amid a slowing domestic economy and global skepticism over the project’s benefits.Most Read from BloombergMarkets Cheer as Milei Drops Dollarization for Macri BrassEverything You Need to Know About China’s Child Pneumonia OutbreakHamas Frees 24 Hostages From Gaza as Israel Truce Holds Steady‘Fear Gauge’ Hits 2020 Low as Stocks Up This Week: Markets WrapXi Tolerance for Property Pain Nears Limit as Rescue EmergesChina will “give priority for the ‘small and beautiful’ projects, focus on those with small investments, quick impact, as well as sound economic, social and environmental benefits,” according to a government document laying out the 10-year vision for Xi’s “project of the century” published Friday.The global infrastructure and trade initiative drew an estimated $1 trillion in the decade since it was launched in 2013. But momentum has tapered off in recent years as the pandemic and China’s slowdown disrupted the global economy. Beijing has also faced accusations of being an irresponsible lender driving countries to default.Read: Xi’s $1 Trillion ‘Project of the Century’ Gets a Reality CheckThe statement was released by a government body that studies BRI-related planning and policies and coordinates efforts to implement the initiative. It reaffirmed the project’s recent shift from massive infrastructure projects.The average BRI deal size fell to $392 million in the first half of this year, 48% smaller than its 2018 peak, according to think tank Green Finance & Development Center. In a forum marking the initiative’s 10th anniversary last month, Chinese officials emphasized sustainable debt and greener, more cost-effective projects.A More Global YuanChina also plans to promote internationalization of yuan in BRI projects, according to the document.China will steadily push forward the use of local currencies in bilateral cooperations with BRI countries, and “encourage greater use of yuan in overseas investment by financial institutions,” the document reads.Read: China and Saudi Arabia Sign Currency Swap Worth $7 BillionRepeating a pledge it made as early as 2015, Beijing said it would support foreign governments and companies with high credit ratings to sell yuan-denominated bonds in China. Meanwhile, qualified Chinese financial institutions and firms will be encouraged to sell bonds in yuan and foreign currencies abroad, with the funds raised to be invested in projects in BRI countries.Such measures could expand international demand for the yuan, such as by creating channels where foreign investors can invest their holdings of the Chinese currency in, as Beijing presses ahead with its ambition to boost the yuan’s global role.Most Read from Bloomberg BusinessweekHow Elon Musk Spent Three Years Falling Down a Red-Pilled Rabbit HoleThe Utah Jazz Enter Their Experimental Post-Cable PhaseX Scrambles to Minimize Damage From Antisemitic PostsGuatemalan Town Invests Remittance Dollars to Deter MigrationMore Americans on Ozempic Means Smaller Plates at Thanksgiving©2023 Bloomberg L.P.",
        "stocks": []
    },
    {
        "title": "Citigroup Resumes Work on Investcorp Capital’s Abu Dhabi IPO",
        "link": "https://finance.yahoo.com/news/citigroup-resumes-investcorp-capital-abu-150837306.html",
        "date": "2023-11-06T15:08:37.000Z",
        "text": "(Bloomberg) -- Citigroup Inc. has returned to working on Investcorp Capital Plc’s initial public offering in Abu Dhabi, after it earlier had to stop that work because it couldn’t get internal approval to participate in the sale, according to people familiar with the matter.Most Read from BloombergTrump Testimony Called a ‘Broken Record’ by Judge: Trial UpdateIsrael Latest: Biden Discusses ‘Tactical Pauses’ With NetanyahuWall Street Faces ‘Reality Check’ After Big Rally: Markets WrapAI Pioneer Kai-Fu Lee Builds $1 Billion Startup in Eight MonthsPrivate Credit Giants Are Butting Heads Over a Hot New Asset ClassThe move comes just weeks after Citigroup, along with rival Goldman Sachs Group Inc., had to stop its work on the IPO after the Abu Dhabi bourse had requested that the IPO have a price stabilization mechanism once the stock start trading.When Citigroup and Goldman originally stopped their work on the deal, none of the lead banks wanted to take on the role of a price stabilization agent as such a mechanism remains in gray area under UAE law. Another broker was brought on to do it.Representatives for Citigroup and Investcorp declined to comment.Emirates NBD Capital, First Abu Dhabi Bank PJSC and HSBC Holdings Plc are working on the IPO as joint global coordinators.Investcorp Capital Plc and Investcorp Holdings, its parent, are seeking to raise as much as 1.49 billion dirhams ($403 million) in the IPO. The offering was covered across the price range on the first day of bookbuilding, with about $250 million being taken up by a special purpose vehicle as a cornerstone investor.Investcorp Capital invests in private equity, real estate, credit and general partner positions in North America, Europe, the Middle East and Asia.Most Read from Bloomberg BusinessweekTop-Ranked MBA Programs Struggle to Reverse Declining ApplicationsWho’s Ready for a Trump-Biden Rematch? Anyone? Hello?The US Housing Market Has Become an Impossible MessOnline Gambling Has Millions of Young Africans Battling AddictionThese Five Countries Are Key Economic ‘Connectors’ in a Fragmenting World©2023 Bloomberg L.P.",
        "stocks": [
            "C"
        ]
    },
    {
        "title": "UPDATE 1-Russian rouble stabilises near 92 vs dollar",
        "link": "https://finance.yahoo.com/news/1-russian-rouble-stabilises-near-103516016.html",
        "date": "2023-11-10T10:35:16.000Z",
        "text": "(Updates at 1021 GMT)MOSCOW, Nov 10 (Reuters) - The Russian rouble steadied near 92 to the dollar on Friday, on course for its fifth weekly rise in a row, supported by high interest rates and higher foreign currency supply from exporters.By 1021 GMT, the rouble was unchanged against the dollar at 92.05, not far from last week's three-month high of 91.6225.It had gained 0.4% to trade at 98.26 against the euro and was unchanged against the yuan at 12.60 .The rouble has strengthened from beyond 100 to the dollar since a presidential decree requiring some exporters to convert a significant portion of foreign currency revenues was announced last month.The central bank's bigger-than-expected rate hike to 15% in late October has also helped.\"The dollar-rouble pair is showing an intention to start consolidating near the 92 mark,\" said Alor Broker's Alexei Antonov. \"Trading turnovers have declined in the last two days.\"This suggests that demand for dollars and yuan from imports is continuing to decline, and exporters are in no hurry to increase foreign currency sales at a worsening exchange rate for them.\"Brent crude oil, a global benchmark for Russia's main export, was up 0.9% at $80.72 a barrel.Russian stock indexes were lower.The dollar-denominated RTS index was down 0.1% to 1,107.5 points. The rouble-based MOEX Russian index was 0.1% lower at 3,235.8 points.Shares in oil major Rosneft jumped to a near three-week high before settling to trade 2% higher, after the company said its board would discuss dividends.Meanwhile, the world's biggest natural gas company Gazprom saw its market capitalisation fall below that of its oil unit Gazprom Neft for the first time since at least 2016, BCS Express analysts said.\"The trigger for the strong growth of Gazprom Neft's shares was the recovery of the oil industry, the high price of oil and the availability of dividends,\" said BCS Express. (Reporting by Reuters; Writing by Alexander Marrow, editing by Tomasz Janowski and Emelia Sithole-Matarise)",
        "stocks": []
    },
    {
        "title": "Russian artist who staged anti-war supermarket protest faces eight years in jail",
        "link": "https://finance.yahoo.com/news/russian-artist-staged-anti-war-120355010.html",
        "date": "2023-11-08T12:03:55.000Z",
        "text": "Nov 8 (Reuters) - State prosecutors in St Petersburg on Wednesday asked a judge to jail a female artist for eight years after she staged a protest against Russia's war in Ukraine by replacing supermarket price tags with calls to stop the conflict.Alexandra Skochilenko, 33, carried out the protest on March 31 last year, replacing price tags with pieces of paper urging an end to the war.She was detained in April 2022 after a shopper complained about her action, which included displaying information about civilians allegedly killed in Russian shelling - something Moscow denied at the time - where supermarket prices would usually be.Skochilenko, who smiled from a courtroom cage on Wednesday, is being tried on the charge of spreading fake information about the Russian army, which is punishable by up to 10 years in jail.She denies her guilt and says her protest was purely a peaceful one. (Reporting by Andrew Osborn Editing by Guy Faulconbridge)",
        "stocks": []
    },
    {
        "title": "OPEC+ Agrees on Deeper Output Cuts to Avoid Renewed Surplus",
        "link": "https://finance.yahoo.com/news/opec-agrees-deeper-output-cuts-151208253.html",
        "date": "2023-11-30T16:40:08.000Z",
        "text": "(Bloomberg) -- OPEC+ agreed to deepen its production cuts following a slump in crude prices and predictions of a renewed surplus next year.Most Read from BloombergBanking Escapees Make Billions From Private Credit BoomTesla’s Cheapest Cybertruck Will Cost $60,990 and Be Available in 2025Saudi Arabia Offers Iran Investment to Blunt Gaza WarThese Are the World's Most Expensive Cities to Live In Right NowBiggest Blowout in Bonds Since the 1980s Sparks Everything RallyMembers of the group agreed to make 1 million barrels a day of additional oil-supply cuts at a meeting on Thursday, delegates said. That reduction comes alongside the much-anticipated extension into next year of Saudi Arabia’s voluntary output curb of the same size.Members have an agreement principle that will now go to a vote, delegates said, asking not the be named because the information was private. Final details of the accord, including national production levels, will be announced individually by each country rather than in the customary OPEC+ communique, they said.Oil traders were unimpressed with the lack of detail. WTI erased initial gains to sink 3.4% to $75.31 a barrel as of 11:30 a.m. in New York.The additional 1 million barrel-a-day cut fulfills what delegates had said was Riyadh’s main goal for the meeting. More than a week of preparatory talks appeared to have overcome internal disagreements over some African nations’ production quotas, which had forced the video conference to be pushed back by several days.“If those numbers get confirmed it shows OPEC+ wants to keep their hands on the oil wheel,” said Giovanni Staunovo, an analyst at UBS Group AG. The alliance is “continuing to apply a proactive stance considering likely seasonally weaker demand at the start of 2024.”Since July, Saudi Arabia has been making an extra voluntary cut of 1 million barrels a day, described by Energy Minister Prince Abdulaziz bin Salman as a “lollipop.” The kingdom was pressing the rest of the Organization of Petroleum Exporting Countries and its allies to join this effort after crude prices fell by more than 10% from their September high. A deeper collective reduction could stave off a renewed oil surplus predicted for early next year.“The Saudi ‘lollipop’ has been successfully socialized into an ‘OPEC+ lollipop’,” said Christyan Malek, global head of energy strategy at JPMorgan Chase & Co., who was one of the first analysts to predict a deeper cut. “If there is anything that proves the cohesion of OPEC+ it’s surely this decision today.”A new group-wide OPEC+ cut of 1 million barrels a day could actually be only half as big in real terms, Amrita Sen, director of research at consultant Energy Aspects Ltd., told Bloomberg television before the meeting. That’s because some countries are already pumping below their targets, she said.Key details on the cuts are still missing, Staunovo said. It was not immediately clear how the cuts would be distributed between members, nor how Russia’s 300,000 barrel-a-day export cut would factor into the new totals.The outlook for oil has weakened over the past two months amid plentiful supplies and a darkening economic backdrop. Price could fall even further next year, when forecasters including the International Energy Agency anticipate a sharp slowdown in demand growth.In a surprise move, Brazil will join the cooperation charter of the OPEC+ oil alliance, a move that won’t bind it to making production cuts. Brazilian Energy Minister Alexandre Silveira told a meeting of the group on Thursday that the country would make the move next year. The charter, open to all oil producing countries, doesn’t bind signatories or limit their sovereign rights.“President Lula confirmed our entry into the OPEC+ cooperation charter from January 2024,” the minister told the group, according to a video circulated by delegates. He was met with a round of applause.--With assistance from Rachel Graham and Ben Bartenstein.(Updates with Brazil affiliation in final paragraphs.)Most Read from Bloomberg BusinessweekNo Laws Protect People From Deepfake Porn. These Victims Fought BackSoaring Canadian Housing Costs Power a Population Boom in AlbertaA $30 Billion Meltdown in Clean Energy Puts Biden’s Climate Goals at RiskScientists and Farmers Race to Save the World’s Banana SupplyFacing a Shortage of Luxury Artisans, LVMH Seeks Apprentices in the US©2023 Bloomberg L.P.",
        "stocks": []
    },
    {
        "title": "Verisign posts higher Q3 revenue on steady demand for domain names",
        "link": "https://finance.yahoo.com/news/verisign-posts-higher-q3-revenue-210915811.html",
        "date": "2023-10-26T21:09:15.000Z",
        "text": "Oct 26 (Reuters) - Internet services firm Verisign reported a 5.4% jump in third-quarter revenue on Thursday, helped by steady demand in domain name registrations as more businesses expand their online presence.Businesses lately have been beefing up their online presence, in a move to digitize, with easy-to-remember domain names to capture a wider range of customers online.The domain name registry services provider posted revenue of $376.3 million for the quarter ended Sept. 30, up from $356.9 million a year ago.It reported a profit of $1.83 per share in the July-September period, higher than $1.58 per share, in the same period last year.The renewal rate for its .com and .net domains fell to 73.4% in the second-quarter, compared with 73.8%, a year earlier.Meanwhile, the company processed 9.9 million domain name registrations in the third quarter, unchanged from a year ago. (Reporting by Jaspreet Singh in Bengaluru; Editing by Shailesh Kuber)",
        "stocks": [
            "VRSN"
        ]
    },
    {
        "title": "US STOCKS-Wall St rises as dovish Fed comments bolster rate cut hopes",
        "link": "https://finance.yahoo.com/news/us-stocks-wall-st-rises-170612059.html",
        "date": "2023-11-28T17:06:12.000Z",
        "text": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)*Micron drops on higher operating expenses forecast*Boeing gains as RBC upgrades to \"outperform\"*Indexes up: Dow 0.49%, S&P 0.36%, Nasdaq 0.42%(Updated at 11:39 a.m. ET/ 1639 GMT)By Shristi Achar A and Amruta KhandekarNov 28 (Reuters) - Wall Street's main indexes reversed course to gain on Tuesday after dovish comments from some Federal Reserve officials bolstered hopes of a potential rate cut next year.Board Governor Christopher Waller hinted at lower interest rates in the months ahead if inflation continued to ease, while Chicago Fed President Austan Goolsbee said he believed overall inflation was coming down at a pace not seen since the 1950s.Money market's expectations of at least a 25-basis point rate cut in May 2024 rose to nearly 63% from about 50% before the central bank officials' comments, according to the CME Group's FedWatch Tool.All three major indexes were on course for monthly gains after three straight months of losses, on the rate cut optimism. The rebound has also brought the S&P 500 within a very close range of its 2023 intra-day high.\"The (Fed) comments are refocusing investors on the idea that the inflation rate is coming down and as the inflation rate comes down, they're hopeful that it'll bring rates down, and ultimately bring the market higher,\" said Rick Meckler, partner at Cherry Lane Investments.Board Governor Michelle Bowman, on the other hand, indicated that the central bank will likely need to further raise borrowing costs to bring inflation down to its 2% target, keeping further gains in check.Personal consumption expenditure data - the Fed's preferred inflation gauge - and the \"Beige Book\", a snapshot of the U.S. economy, which are due later this week, will likely show how the economy is faring under tighter monetary conditions.At 11:39 a.m. ET, the Dow Jones Industrial Average was up 174.29 points, or 0.49%, at 35,507.76, the S&P 500 was up 16.54 points, or 0.36%, at 4,566.97, and the Nasdaq Composite was up 59.27 points, or 0.42%, at 14,300.29.Ten of the 11 major S&P 500 sectors were in the green, with utility stocks up 0.8% and leading gains.Data showing a rise in U.S. consumer confidence in November after three straight monthly declines also helped lift the market sentiment.Among single stocks, Boeing added 2.3% after RBC Capital Markets upgraded the aerospace company to \"outperform\" from \"sector perform\" and set a Street-high price target.U.S.-listed shares of PDD Holdings jumped 17.6% after the Chinese e-commerce firm beat third-quarter revenue estimates.Affirm Holdings added 5.9%, extending its gains from Monday, as Jefferies upgraded the payments platform and data showed more price-conscious shoppers had turned to buy now, pay later (BNPL) services during Cyber Monday.Meanwhile, Micron Technology shares fell 2.4% after the chip firm said it expects first-quarter operating expenses to be higher than its prior estimates.Advancing issues outnumbered decliners by a 1.74-to-1 ratio on the NYSE and by a 1.18-to-1 ratio on the Nasdaq.The S&P index recorded 19 new 52-week highs and one new low, while the Nasdaq recorded 55 new highs and 81 new lows.(Reporting by Shristi Achar A and Amruta Khandekar in Bengaluru; Editing by Shinjini Ganguli)",
        "stocks": [
            "^GSPC",
            "^DJI",
            "BA",
            "COMP"
        ]
    },
    {
        "title": "Peru Makes Unexpected Move That May Limit Impeachment Turmoil",
        "link": "https://finance.yahoo.com/news/peru-makes-unexpected-move-may-212202003.html",
        "date": "2023-11-16T21:22:02.000Z",
        "text": "(Bloomberg) -- Peru’s congress over the last seven years has become notorious for its unchecked powers to impeach presidents, putting the nation under seven different leaders in that time while undercutting growth in what had been one of the region’s standout economies.Most Read from BloombergAston Martin Owner Lawrence Stroll Sells F1 Team Stake at £1 Billion ValuationHamas Mastermind Who Tricked Israel Is Top Target in Gaza TunnelsApple Plans to Make It Easier to Text Between iPhones and AndroidsApple’s Effort to Replace Qualcomm Chip in iPhone Falls Further Behind‘Fed-Friendly’ Data Lift Bonds as S&P 500 Wavers: Markets WrapBut on Thursday, congress took an initial surprise step to curtail those powers that could improve governance by passing legislation to create a second chamber of congress, diluting the powers of a parliament that currently only has one chamber.The vote by a super majority of 93 of 130 lawmakers will allow them to push this reform through if they can muster a super majority in a second vote next year. Had lawmakers obtained only a simple majority, they would have had to put the measure to a national referendum. The news came as a shock to most Peruvians given congress’s failure to keep the public informed and in the loop.A broad consensus of Peru watchers agree that the country’s current single-chamber congress has created significant problems for its democracy. The extreme political volatility triggered by the cycle of impeachments has taken a toll on Peru’s economy, once among the fastest-growing in Latin America, which this year fell into a recession.Read More: Impeachment Mania Unravels an Economic Miracle in Latin America“I think that in theory this is a good reform, the issue is that congress has a legitimacy problem,” said Gonzalo Banda, a Peruvian political analyst. “In any decent country, a reform like this would have had public discussions to address the pros and cons, but not in Peru.”In 2018, 91% of Peruvians in a referendum rejected the proposed creation of a Senate. But the move also faces questions of motivation. In the same referendum, Peruvians voted against allowing for the reelection of lawmakers, but the new bill passed Thursday would not place term-limits on senators.Congressional HistoryPeru has had two chambers of congress for most of its history. But it was President Alberto Fujimori who in 1992 illegally dissolved congress and then streamlined it into one chamber, after rewriting the constitution.This newer structure has long been criticized by political scientists, who argue that a single chamber can have too much power and face too little scrutiny. For example, impeaching a president requires a single vote in congress and the whole process can be carried out in less than a week.The result has given congress great power and has made it deeply unpopular. An Ipsos poll this month found congress only has an 11% approval rating, just slightly better than Boluarte’s 10% approval rating.The vote “Is a first step towards strengthening the institutional framework. Should be positive for the market,” said Gonzalo Navarro, a currency strategist with bank BBVA in an email to clients.But even political scientists who support the move, have been skeptical that congress will be able to push it through.“A congress with an approval rating this low does not have enough legitimacy to approve constitutional changes this important,” said Fernando Tuesta, a professor of political science at Peru’s Pontifical Catholic University who also headed the committee that proposed the failed referendum to create the senate back in 2018.Most Read from Bloomberg BusinessweekSequoia Icon Michael Moritz Bets $300 Million on Reshaping San FranciscoWhy America’s Wind Power Failures Are Good for GEThe Impact and Cost of Musk’s Endorsement of Antisemitism on XAt REI, a Progressive Company Warns That Unionization Is Bad for VibesPeter Thiel Is Still Hoping That Donald Trump Just Fades Away©2023 Bloomberg L.P.",
        "stocks": []
    },
    {
        "title": "Fed’s Daly Says Rates in ‘Very Good Place,’ Not Considering Cuts",
        "link": "https://finance.yahoo.com/news/fed-daly-says-rates-very-140000342.html",
        "date": "2023-11-30T14:00:00.000Z",
        "text": "(Bloomberg) -- Federal Reserve Bank of San Francisco President Mary Daly said interest rates are in a “very good place” to control inflation though she’s not thinking about cuts and that it was too soon to say if hikes are finished.Most Read from BloombergSaudi Arabia Offers Iran Investment to Blunt Gaza WarBanking Escapees Make Billions From Private Credit BoomThese Are the World's Most Expensive Cities to Live In Right NowTesla’s Cheapest Cybertruck Will Cost $60,990 and Be Available in 2025Biggest Blowout in Bonds Since the 1980s Sparks Everything RallyIn an interview with Germany’s Börsen-Zeitung newspaper conducted earlier this month and published Thursday, her remarks echoed other policymakers who have made the case for keeping rates on hold.Read more: Fed’s 2024 Voters Signal No Urgency to Raise Interest RatesWhile she said it was “premature” to declare victory in the fight against inflation and it remained too high, she expressed no bias to tighten “excessively” after the aggressive steps the Fed has already taken.“Policy is in a very good place. We have raised the key interest rate significantly,” she said, according to a transcript of the interview. “We don’t need an insurance mentality now, where we hedge against rising inflation. We should simply be patient and remain vigilant.”Traders bet the Fed will hold the target range for its benchmark interest rate uncaged at 5.25% to 5.5% when officials meet Dec. 12-13 and that the next move will be down.Billionaire investor Bill Ackman made waves this week when he said he’s betting the Fed will begin trimming rates even sooner than markets are predicting.But Daly, who votes on the rate-setting Federal Open Market Committee next year, called talk about rate cuts “not particularly helpful at the moment.”“I’m not thinking about rate cuts at all right now,” she said. “I’m thinking about whether we have enough tightening in the system and are sufficiently restrictive to restore price stability.”Speculation that the US central bank will pivot to easing policy next year has been spurred by concerns that the economy is losing steam.The Fed’s latest Beige Book survey of regional business contacts, published Wednesday, showed US economic activity slowed in recent weeks as consumers pulled back on discretionary spending.But Daly dismissed suggestions that growth was in imminent peril.“Our inflation data are improving and our real economy has not stalled,” she said. “I don’t see a recession on the horizon at the moment.”Most Read from Bloomberg BusinessweekNo Laws Protect People From Deepfake Porn. These Victims Fought BackSoaring Canadian Housing Costs Power a Population Boom in AlbertaA $30 Billion Meltdown in Clean Energy Puts Biden’s Climate Goals at RiskScientists and Farmers Race to Save the World’s Banana SupplyFacing a Shortage of Luxury Artisans, LVMH Seeks Apprentices in the US©2023 Bloomberg L.P.",
        "stocks": [
            "BSFO"
        ]
    },
    {
        "title": "GLOBAL MARKETS-World shares wobble, yen slides after BOJ policy tweak",
        "link": "https://finance.yahoo.com/news/global-markets-world-shares-wobble-155257800.html",
        "date": "2023-10-31T15:52:57.000Z",
        "text": "*Results disappoint Wall Street as focus turns to Fed meeting*Japanese yen slides under 150 per dollar*BOJ policy tweak seen as inadequate*Chinese data sparks worries over economyBy Herbert Lash and Tom WilsonNEW YORK/LONDON, Oct 31 (Reuters) - Global stocks wobbled on Tuesday following weak U.S. earnings a day before the Federal Reserve is expected to again say rates will stay high for longer, while the yen slid after the Bank of Japan's step to end years of monetary stimulus left investors cold.While shares in Europe gained as investors drew comfort from resilient regional results, Asian equities earlier lost ground on renewed fears over the prospects for the Chinese economy following weak manufacturing data.On Wall Street, heavy-machinery maker Caterpillar fell 6.1% as dealer inventories rose and a large order backlog shrank, indicating demand is slowing. Pfizer's shares fell 1.7% after the drugmaker reported its first quarterly loss since 2019.\"Earnings forecasts for the fourth quarter are coming down,\" said Anthony Saglimbene, chief market strategist at Ameriprise Financial in Troy, Michigan. \"A lot of that has to do with the guidance that's coming from S&P 500 companies, which has been more conservative.\"Fourth-quarter earnings growth for S&P 500 companies as of Friday has fallen to 8.5% from 11.0% expected on Oct. 1, according to LSEG data.Meanwhile, investors are waiting to see what the Fed says after a two-day policy meeting ends on Wednesday, which is unlikely to deter significantly from past statements.\"It's going to be the same dry higher for longer message that the markets continue to struggle with,\" Saglimbene said.MSCI's U.S.-centric gauge of stocks across the globe slipped 0.07%, while the pan-European STOXX 600 index rose 0.59%.The Dow Jones Industrial Average fell 0.1%, the S&P 500 gained 0.04% and the Nasdaq Composite dropped 0.2%.The yen fell about 1.5% to a new one-year low of 151.32 after the BOJ eased its grip on long-term rates by further loosening its bond yield control policy (YCC) on what analysts viewed as a small and insufficient step.The yen fell as traders focused on the BOJ's dovish pledge to \"patiently\" maintain accommodative policy, and forecast inflation to slow below 2% in 2025.The yen also weakened further against the euro, with the single currency up 1.5% to a 15-year high of 160.64.Longer-dated Treasury yields dipped as investors awaited the Fed statement and comments from Fed Chair Jerome Powell.Benchmark 10-year notes last week hit 16-year highs as investors contemplate higher yields for longer, and on concerns about increasing U.S. Treasury supply.The yield on 10-year Treasury notes fell 2.5 basis points to 4.852%.Euro zone yields fell as individual country inflation data pointed to a lower print for the currency bloc overall later in the day. Germany's benchmark 10-year yield fell 5.5 basis points to 2.77%, testing the previous day's two-week low.Asian equities earlier slid as Chinese manufacturing activity returned to contraction, reviving worries over the world's second-largest economy. Recent indicators had showed a nascent recovery in China.The dollar index, which measures the U.S. currency against six rivals, gained 0.48%. The euro looked set to reverse two straight months of losses with a 0.3% gain for October.The single currency was last up 0.3% at $1.0662.Oil prices were steady on Tuesday as a drop in euro zone inflation was balanced by higher OPEC output.U.S. crude recently fell 0.06% to $82.26 per barrel and Brent was at $87.65, up 0.23% on the day.(Reporting by Tom Wilson in London and Ankur Banerjee in Singapore; Editing by Lincoln Feast, Kim Coghill, Miral Fahmy, Jan Harvey and Emelia Sithole-Matarise)",
        "stocks": [
            "^GSPC",
            "^DJI",
            "COMP"
        ]
    },
    {
        "title": "Citadel Securities explores China licence as Beijing steps up market-making program",
        "link": "https://finance.yahoo.com/news/citadel-securities-explores-china-licence-073454263.html",
        "date": "2023-11-13T07:34:54.000Z",
        "text": "By Selena Li and Summer ZhenHONG KONG (Reuters) - Citadel Securities, one of the world's biggest market-making firms, is \"actively exploring\" establishing a licensed onshore business in China, its chief executive Peng Zhao said.If Citadel Securities were to obtain a licence, it would be the first foreign firm to formally foray into market-making in China outside interbank and foreign exchange market making.Over the last two years, Chinese authorities have encouraged the development of market makers, approving more licences and pledging to roll out more types of derivatives as they seek to boost liquidity and draw in more long-term capital.At least 16 domestic securities brokerage firms have been given the nod to act as market makers in China A shares as of mid-September, official records show.\"We are pleased to see the introduction of the market-making program in China,\" Zhao told Reuters in an interview in Hong Kong. He declined to disclose the specific licence the company might seek.\"As the Chinese capital market continues to grow beyond simple stock trading and into more complex products, the concept of market making not only will come naturally but also becomes necessary instead of just adding value from a liquidity perspective,\" Zhao said.Billionaire Ken Griffin's Citadel Securities, which handles about $390 billion in trades per day, is one of the top market makers by trading volume in the United States.Market makers quote both buy and sell prices for assets and are constant trading participants in the market, earning profit through the spread of bid and offer prices.China's nascent market-making sector could grow to be worth 250 billion yuan ($34 billion) in revenues in 2032, compared with an estimated 40 billion yuan last year, according to Chinese brokerage Haitong.Market-making was first introduced in China in 2014. In February, Beijing started to allow licenced securities brokerage firms to act as market makers for its newest board Beijing Stock Exchange, following a similar move in May 2022 for its Nasdaq-style STAR Market.Citadel Securities in July appointed Tony Tang, the former head of BlackRock's China business, to helm its China operations.In February, it became a \"qualified foreign institutional investor\" in China, a few months after the country allowed qualified foreign institutions to trade more broadly in domestic futures and options instruments.The wider access it gained with that licence covers bonds, futures and options in addition to stocks it traded via China's Stock Connect Programme.This year, Citadel Securities also launched an investment-grade corporate bond market-making business in the United States. It is now looking to bring that business to Asia. Currently, it focuses on helping clients in Asia trade in U.S. assets such as U.S. Treasuries and U.S. dollar interest rate swaps.Since 2020, the brokerage has more than doubled its Asia Pacific headcount to nearly 300 people, a contrast to the wider trend of Wall Street layoffs amid depressed deal activity due to high interest rates and geopolitical uncertainty.(Reporting by Summer Zhen and Selena Li in Hong Kong; Editing by Sumeet Chatterjee and Edwina Gibbs)",
        "stocks": []
    },
    {
        "title": "UPDATE 2-AI chips boost Marvell revenue as infrastructure and enterprise suffer",
        "link": "https://finance.yahoo.com/news/2-ai-chips-boost-marvell-232415366.html",
        "date": "2023-11-30T23:24:15.000Z",
        "text": "(Rewrites story, updating with CEO interview quotes throughout)By Arsheeya Bajwa and Max A. CherneyNov 30 (Reuters) - Chipmaker Marvell Technology said on Thursday it expects its data center business to continue to grow next year even as roughly half its revenue will decline in the first quarter as its customers face tough conditions.Its shares fell more than 4% in after-hours trading.CEO Matthew Murphy attributed the anticipated drop in revenue from its segments including wireless carrier infrastructure and enterprise to a tough macroeconomic environment and longer-than-expected inventory corrections by its customers.\"You've seen it in announcements from the big enterprise companies and you've also seen it from the carrier companies,\" Murphy said in an interview with Reuters. \"It's a very weak environment.\"The data center segment, which includes its custom AI chip business and networking equipment, beat market expectations for revenue in the third quarter of 2024. Murphy said he expects the segment to continue to grow but that it's difficult to predict how that will fare next year largely because of AI.\"The real swing is the AI portion - in terms of how it's going to grow, what's the magnitude of it,\" Murphy said. \"It's gone up so much this year.\"Marvell helps companies such as Amazon.com's cloud computing unit build custom chips.For the company's enterprise and carrier business, inventory clearing has dampened prospects of new orders for chip makers like Marvell.Murphy said on an earnings call that while Marvell does expect year-on-year growth going forward, he could not comment on concerns surrounding inventory build hindering growth projections for the first quarter.The company's fourth-quarter forecast came in below Wall Street estimates.For the current quarter, Marvell expects revenue of $1.42 billion plus or minus 5%, compared with estimates of $1.46 billion.On an adjusted basis, the company expects income of 46 cents per share, plus or minus 5 cents for the fourth quarter. This compares to estimates of 49 cents profit per share.However, Marvell beat Wall Street estimates for third-quarter revenue and profit, as the rapid adoption of artificial intelligence (AI) buoyed demand for its chips.Marvell posted net revenue of $1.42 billion for the quarter ended Oct. 28, compared with analysts' estimates of $1.40 billion, according to LSEG data.Excluding items, the company posted a profit of 41 cents per share, marginally beating estimates of 40 cents per share. (Reporting by Arsheeya Bajwa in Bengaluru and Max A. Cherney in San Francisco; Editing by Shailesh Kuber and Sonali Paul)",
        "stocks": [
            "MRVL"
        ]
    },
    {
        "title": "Dozens of union workers arrested on Las Vegas Strip for blocking traffic as thousands rally",
        "link": "https://finance.yahoo.com/news/thousands-las-vegas-hotel-workers-011259202.html",
        "date": "2023-10-26T01:12:59.000Z",
        "text": "LAS VEGAS (AP) — Thousands of hotel workers fighting for new union contracts rallied on the Las Vegas Strip on Wednesday evening, halting rush-hour traffic before dozens were arrested for sitting in the street. The stepped-up labor unrest aimed to draw attention to negotiations with three major casino companies.Seated in two separate circles, workers in red T-shirts blocked cars in both directions for roughly 30 minutes as the sun sank in the west, casting golden rays across one of the most recognizable stretches of the Strip near the Bellagio fountain, the Eiffel Tower replica and Caesars Palace. Police officers with zip ties eventually started taking protesters into custody, leading them to a white police bus with flashing red and blue lights.Las Vegas police said 58 people were cited for assembling to disturb the peace, a misdemeanor.“The event was peaceful,” Lt. Mark Lourenco said via text message.The Culinary Workers Union overwhelmingly voted last month to authorize a strike if they don’t soon reach agreements with MGM Resorts International, Caesars Entertainment and Wynn Resorts.The companies did not immediately respond to emailed requests for comment Wednesday.It also comes at the same time casino workers in Michigan, including employees of the MGM Grand Detroit, are on strike.Leaders of the Culinary Workers Union said they wanted a show of force ahead of any potential strike.As the protest began, Kimberly Dopler, a cocktail server at Wynn Las Vegas since it opened in 2005, said she planned to halt traffic.“I’m hoping that the companies will listen to us and realize that we’re not joking. We’re ready to walk out,” she said.Two visitors from Missouri, Cindy Hiatt and Michelle Shirley, watched as the rally began. They said they won’t return to Las Vegas again during any potential strike by hotel workers.“The hotels are going to have to realize that they’re not going to have people wanting to come to Vegas without these workers,” Hiatt said.A Las Vegas strike deadline has not yet been set as the union and casino companies return to the bargaining table this week. But Ted Pappageorge, the union’s secretary and treasurer, told reporters this month that thousands of workers who keep the Strip’s hotel-casinos humming could walk off the job in the coming weeks if the latest round of negotiations aren’t productive.The culinary union is the largest labor union in Nevada with about 60,000 members. Contracts for about 40,000 of them in Las Vegas expired recently, and negotiations have been underway for months over topics such as pay and working conditions.Bethany Khan, the union’s spokesperson, said in an interview after the protest that the union will cover all legal fees for the workers who were arrested, including bail and any costs for legal representation in court.Kahn said all union members currently receive health insurance and earn about $26 hourly, including benefits. She declined to say how much the union is seeking in pay raises because “we do not negotiate in public,” although the union has said it is asking for “the largest wage increases ever negotiated” in its history.The union hasn’t gone on strike in more than three decades. A walkout would be the latest in a series of high-profile job actions around the country, including walkouts in Hollywood and the auto production lines in Detroit.Leslie Lilla, a cocktail server at the Bellagio for 25 years, said earlier this month that union members have been preparing for a possible strike and are ready and willing to walk off the job.“We’re ready to show our company by our feet, and that means walking ourselves right out of the building,” she said. “So we’ve been saving and we’ve been putting money into our accounts.”____Associated Press writer Scott Sonner in Reno, Nevada, contributed to this report.",
        "stocks": []
    },
    {
        "title": "Moore Capital Alumnus Grover Closing Hong Kong Hedge Fund Firm",
        "link": "https://finance.yahoo.com/news/moore-capital-alumnus-grover-closing-035553027.html",
        "date": "2023-11-13T03:55:53.000Z",
        "text": "(Bloomberg) -- Moore Capital Management alumnus Gaurav Grover is shutting down his Hong Kong-based hedge fund firm Trikon Asset Management Ltd. after about five years, said people with knowledge of the matter.Most Read from BloombergChina Weighs Ending Freeze on Boeing With 737 Max Deal in USIceland Girds for Volcanic Eruption That Could Wipe Out TownBiden Has Wiped Away $127 Billion in Student Loan DebtSunak Fires Braverman and Names David Cameron Foreign SecretaryGoldman Sachs, Morgan Stanley Diverge on Fed Rate-Cut ForecastsGrover is taking a break to spend more time with his family and does not plan to retire, the people added, asking not to be identified discussing private matters. The firm started to notify investors and counterparties about three weeks ago, even though there was client interest to expand its assets through other products, said one of the people.Grover declined to comment.Grover helped set up Moore’s Asia office in Hong Kong in 2010 and was a senior portfolio manager at Louis Bacon’s hedge fund firm. He started Trikon with members of his Moore investing team. It was one of the most promising startups of 2018, counting among its early investors some partners of his former employers, including TPG-Axon Capital Management LP and Silver Lake Management LLC.Trikon’s hedge fund was up 2.9% this year through August, bettering the flat return of a Eurekahedge gauge tracking Asia-Pacific funds that bet on rising and falling stocks. Flat in its first two months of trading in 2018, the Trikon fund made money in the next three years. Last year, it dipped 1.3%, according to a newsletter seen by Bloomberg News.Grover’s decision was unrelated to the state of the Asian stock markets or mounting geopolitical tensions, the people said. Regulatory uncertainty in China and a slowdown of the world’s second-largest economy have combined with the US-China spat and rising interest rates to wreak havoc on regional hedge fund performance.Asia-focused hedge funds on average had the worst annual loss since 2008 last year, according to a Eurekahedge Pte index. More than two-thirds of them lost money in 2022, Preqin Ltd. data showed. They have again struggled to make money this year. Investors redeemed $7.5 billion out of Asia-based funds in the first nine months, more than triple the amount in 2022, eVestment estimated.Most Read from Bloomberg BusinessweekEverything Biden and Xi Need From Their Summit—Starting With Each OtherCan a Triangle-Shaped Jet Cut Fuel Consumption in Half?A German Startup Races Google to Develop a Universal TranslatorUS Veterans Got a Mortgage Break. Now They’re Losing Their HomesElon Musk’s Brain Implant Startup Is Ready to Start Surgery©2023 Bloomberg L.P.",
        "stocks": []
    },
    {
        "title": "Brazil arrests two with suspected Hezbollah ties plotting attack -sources",
        "link": "https://finance.yahoo.com/news/brazil-arrests-two-suspected-hezbollah-183432196.html",
        "date": "2023-11-08T18:34:32.000Z",
        "text": "By Rodrigo Viga GaierRIO DE JANEIRO, Nov 8 (Reuters) - Brazil's Federal Police on Wednesday arrested two people in a group suspected of being financed by Hezbollah that was allegedly preparing domestic attacks and looking to recruit Brazilians, three sources with knowledge of the probe told Reuters.The Federal Police said in a statement they arrested two people, who they did not name, on terrorism charges in Sao Paulo. They also carried out search and seizure warrants in Sao Paulo, Brasilia and Minas Gerais states. The police statement did not mention Hezbollah, an Iran-backed group in Lebanon.Hezbollah could not immediately be reached for comment.\"The Federal Police is carrying out an investigation based on the hypothesis of a terrorist network that was trying to install itself in Brazil,\" Justice Minister Flavio Dino said at an event in Rio de Janeiro.Jewish leaders told Reuters last month that they had noticed a rise in antisemitic discourse online, amid a broader global surge in antisemitism since the Oct. 7 attack by Hamas on southern Israel and subsequent bombardment of the Gaza Strip by the Israeli military.\"We're following with apprehension and concern this Federal Police operation today. Brazil doesn't have a history of terrorism and we hope that the conflict in the Middle East isn't imported over to here,\" said Ricardo Berkiensztat, executive president of the Jewish Federation of the State of Sao Paulo (Fisesp).Hezbollah was set up by Iran's Revolutionary Guards in 1982 to fight Israeli forces that had invaded Lebanon. The heavily armed powerful group has seats in parliament and government and acts as Iran's spearhead in Lebanon and the region.Since the Oct. 7 attack, Hezbollah has been engaging Israeli forces along the border, in the deadliest escalation since it fought a war with Israel in 2006.Hezbollah has been designated a terrorist organization by Argentina, Britain, Canada, Germany, Honduras and the United States, as well as most U.S.-allied Gulf states. Former Brazilian President Jair Bolsonaro said in 2019 he planned to also label Hezbollah a terrorist organization, but the move never took place.(Additional reporting by Steven Grattan, Gabriel Stargardter and Lisandra Paraguassu Writing by Gabriel Stargardter; Editing by Lisa Shumaker)",
        "stocks": []
    },
    {
        "title": "HSBC says worst over for China real estate as Q3 profit disappoints",
        "link": "https://finance.yahoo.com/news/hsbc-q3-pre-tax-profit-041551034.html",
        "date": "2023-10-30T04:15:51.000Z",
        "text": "By Selena Li and Lawrence WhiteHONG KONG/LONDON (Reuters) -The worst may be over for China's shaky commercial real estate market, HSBC said on Monday, as a further $500 million charge from the sector helped drag third quarter profits at Europe's biggest bank below market forecasts.While HSBC announced a new $3 billion share buyback and said profits for July-September more than doubled amid higher interest rates, its shares reacted with a shrug as investors took in the China impairment and increased cost forecasts.\"I do think the major correction (in China's property market) is over and it's now a case of a progressive work over an extended period of time,\" HSBC Chief Executive Noel Quinn told reporters.Fears about the debt-laden sector have weighed on foreign banks that lend to developers in China, especially after rival Standard Chartered reported an unexpected plunge in profit due to a nearly $1 billion hit from real estate and banking.All eyes are on China's embattled property giant Evergrande Group which has more than $300 billion of liabilities after it defaulted on its offshore debt in late 2021.Hong Kong's High Court said on Monday the next hearing on Dec. 4 would be the last before a decision is made on liquidating the company.HSBC finance chief Georges Elhedery said the bank still expected \"a couple of quarters of difficulty as the sector adjusts,\" but that the longer term outlook was more positive.Commenting on HSBC's exposure to China, Hargreaves Lansdown equity analyst Matt Britzman said: \"There’s still a cloud of uncertainty hovering over the market, but investors will be happy to see no nasty surprises\".The bank's overall results show the hurdles it faces in delivering the consistent returns its investors expect amid high inflation and pressure on borrowers, even as it showers them with cash from dividends and buybacks.HSBC said costs would increase by up to 5% this year excluding the acquisition of Silicon Valley Bank's British unit, more than its previous goal of a 3% rise, as spending grows and it considers bigger bonuses for bankers in the fourth quarter.The bank posted a pretax profit of $7.7 billion for the July to September quarter, versus $3.2 billion a year earlier, but the result trailed the $8.1 billion mean average estimate of brokers compiled by HSBC.\"Costs are likely to be the area of controversy\", said London-based Jefferies analyst Joe Dickerson, though he added the share buyback was $1 billion larger than his forecast.The London-headquartered bank with a market value of $118.6 billion said it aimed to complete the share buyback by next February, lifting the total buybacks announced this year to $7 billion.It also set the third interim dividend this year at 10 cents per share, bringing the total annual payout so far to 30 cents per share.HSBC shares in London were broadly flat, underperforming a 0.7% gain in the benchmark FTSE 100 index.Third-quarter revenues rose 2% in HSBC's Global Banking and Markets division that houses its investment bank, a more robust performance than rival Barclays' 6% drop, as HSBC's large payments business benefited from higher interest rates.The bank's wealth business, which it is prioritising for growth, attracted $34 billion of net new invested assets in the quarter and revenues have grown 12% so far this year as rate hikes let it reap bigger margins on lending.(Reporting by Selena Li in Hong Kong and Lawrence White in LondonEditing by Muralikumar Anantharaman and Mark Potter)",
        "stocks": [
            "HSBC",
            "HSBA.L"
        ]
    },
    {
        "title": "UPDATE 3-German government supports Siemens Energy with $8 bln guarantees",
        "link": "https://finance.yahoo.com/news/1-german-government-unveils-deal-145449388.html",
        "date": "2023-11-14T14:54:49.000Z",
        "text": "*Siemens Energy gets 12 bln euro guarantee line from banks*Government provides counter guarantee to banks*Siemens AG shares +2.75%, Siemens Energy shares +2.95%(Adds details from sources, updates shares)By Christian Kraemer and Alexander HübnerBERLIN/MUNICH, Nov 14 (Reuters) - The German government on Tuesday said it had decided to backstop Siemens Energy with guarantees worth 7.5 billion euros ($8.1 billion) as part of a deal with other stakeholders to help the troubled energy company fulfil its order book.Deepening problems at the firm's wind turbine unit Siemens Gamesa and a subsequent move by S&P to cut the group's long-term credit rating to BBB-, just one notch above junk, during the summer had made banks more reluctant to provide guarantees.Siemens Energy in October disclosed talks with the government, banks and former parent Siemens AG over what sources said were guarantees for project and warranty bonds needed to safeguard the firm's 109 billion euro order book.\"The group has a problem as a result of the takeover of the Spanish company Gamesa, faulty wind turbines, which in turn has put the company, which is otherwise in good health and has full order books, in a precarious situation,\" Economy Minister Robert Habeck said.Berlin's decision to step in reflects its view of Siemens Energy, which makes gas and wind turbines as well as large converter states, as a maker of vital equipment for the country's transition away from polluting fossil fuels.The guarantees are part of a package totalling 15 billion euros agreed with private banks and other stakeholders and would also impose a pause on dividends and higher level bonuses at Siemens Energy, the economy ministry said in a statement.Private banks were expected to provide Siemens Energy with guarantees worth 12 billion euros while Siemens Energy would seek another 3 billion from other sources, the statement said, adding it was conditional on the final sign-off of all parties.The 3 billion euros in guarantees will likely come from international stakeholders such as Denmark and Spain, where Siemens Energy has a significant presence, two people familiar with the matter said.GUARANTEES, NOT CASHThe government will provide the 7.5 billion euros as a counter guarantee to the private banks in order for them to come through, the statement said.\"We are pleased with the German government's clear support for Siemens Energy and the commitment to the rapid implementation of projects to make the energy transition a success,\" Siemens Energy said in a statement.\"We will provide further details at our annual press conference on November 15.\"In a separate statement, Siemens AG said it had been working to find a solution and would share further details at a later stage.Shares in Siemens AG and Siemens Energy closed up 2.75% and 2.95%, respectively, following the news.Reuters first reported last week that all stakeholders had reached an agreement in principle to cover the guarantees, helping the group's shares to recover after news of the discussions pushed the stock to a record low last month.Siemens AG, which spun off Siemens Energy in 2020, is also expected to provide support by buying most of the 24% stake Siemens Energy owns in Siemens Ltd, an Indian joint venture, sources have told Reuters.Siemens AG will pay more than 2 billion euros for around 18% of Siemens Ltd, which would bring its own stake in the joint venture to around 70%, the sources said.Justice Minister Marco Buschmann had defended the deal ahead of the announcement.\"It's not about the state somehow saving a company without a business model, a broken company,\" said Buschmann in an interview with RTL and ntv. He stressed the deal did not involve subsidies. \"It's not about cash, it's about guarantees.\"($1 = 0.9240 euros) (Reporting by Christian Kraemer, Riham Alkousaa, Markus Wacket, Andreas Rinke, Alexander Hübner, Christoph Steitz and Linda Pasquini; Writing by Madeline Chambers and Matthias Williams; Editing by Kirsti Knolle and David Evans)",
        "stocks": [
            "SIE",
            "SIEGY"
        ]
    },
    {
        "title": "SpaceX eyes $15 bln in sales next year on Starlink strength - Bloomberg News",
        "link": "https://finance.yahoo.com/news/spacex-eyes-15-bln-sales-221550328.html",
        "date": "2023-11-06T22:15:50.000Z",
        "text": "Nov 6 (Reuters) - SpaceX is on track to book revenue of about $9 billion this year across its rocket launch and Starlink businesses with sales projected to rise to around $15 billion in 2024, Bloomberg News reported on Monday, citing people familiar with the matter.Sales for Starlink, in particular, are expected to outpace and exceed the launch business next year as the product becomes available in more regions around the world, according to the report.SpaceX is on track to register earnings, excluding some items, of more than $3 billion, Bloomberg News said.SpaceX did not immediately respond to a Reuters request for comment. (Reporting by Chavi Mehta in Bengaluru; Editing by Shounak Dasgupta)",
        "stocks": []
    }
]